---
kind: property
id: P:Autodesk.Revit.DB.NurbSpline.CtrlPoints
source: html/7137825e-3588-b3ee-a477-477151723a3e.htm
---
# Autodesk.Revit.DB.NurbSpline.CtrlPoints Property

Returns the control points of the nurb spline.

## Syntax (C#)
```csharp
public IList<XYZ> CtrlPoints { get; }
```